## 1.块级元素与内联元素
* 块级元素(默认block)可以设置宽高，独占一行
* 内联元素(默认inline)不可以设置宽高，和其他内联元素同一行
* 内联元素:a,span,td,input,button
* 而display可以让内联元素和块级元素进行转化

## 2.新窗口打开
* 对于a标签来说，有一个属性target,默认为_self,就是在本窗口打开
* 设置为_blank就是在新窗口打开,另外iframe的name属性配合a标签的target属性实现页面局部刷新
* _parent -- 在父窗体中打开链接
* _top -- 在当前窗体打开链接，并替换当前的整个窗体(框架页)

## 3.置换元素与不可置换元素
* 置换元素:内容不受css视觉格式化模型控制，css渲染也不考虑对该元素的内容渲染，该元素本身拥有一定尺寸(宽度高度)
* 不可置换元素:html中的大多数元素都是不可置换元素，内容可以直接表现在浏览器端
* `为什么有些元素是内联元素却可以设置宽高?例如图片img`
* 这是因为img是置换元素，浏览器会根据它的标签和属性来决定元素的显示位置和大小，而且即使只设置了宽度，图片高度也会自适应显示
* 置换元素:img,textarea,input,button,select
* `内联的不可置换元素设置宽高是没用的，如span,内联的不可置换元素的宽高默认为内容大小,所以想要改变span宽高需要设置的是width和line-height`
```		
<span style="width: 1000px;background: rgba(7,17,27,.5);height: 100px;">内联的不可置换元素设置宽高是没用的，如span</span>
<img src="../小米/img/after/2.png" style="width: 300px;">
```
